grevaillot/svd_tools/headers/STM32H7x5_CM4/i2c3.h
#pragma once 

/* --- I2C3: I2C ---------------------------------------------------- */

/** @defgroup i2c3_registers I2C Register
@{*/

/** I2C3_CR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_CR1			MMIO32(I2C3_BASE + 0x00)
/** I2C3_CR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_CR2			MMIO32(I2C3_BASE + 0x04)
/** I2C3_OAR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_OAR1			MMIO32(I2C3_BASE + 0x08)
/** I2C3_OAR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_OAR2			MMIO32(I2C3_BASE + 0x0c)
/** I2C3_TIMINGR Access: No wait states **/
#define I2C3_TIMINGR			MMIO32(I2C3_BASE + 0x10)
/** I2C3_TIMEOUTR Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK. **/
#define I2C3_TIMEOUTR			MMIO32(I2C3_BASE + 0x14)
/** I2C3_ISR Access: No wait states **/
#define I2C3_ISR			MMIO32(I2C3_BASE + 0x18)
/** I2C3_ICR Access: No wait states **/
#define I2C3_ICR			MMIO32(I2C3_BASE + 0x1c)
/** I2C3_PECR Access: No wait states **/
#define I2C3_PECR			MMIO32(I2C3_BASE + 0x20)
/** I2C3_RXDR Access: No wait states **/
#define I2C3_RXDR			MMIO32(I2C3_BASE + 0x24)
/** I2C3_TXDR Access: No wait states **/
#define I2C3_TXDR			MMIO32(I2C3_BASE + 0x28)

/**@}*/


/** @defgroup i2c3_cr1 CR1 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C3_CR1_PECEN PEC enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_CR1_PECEN		(1 << 23)
/** I2C3_CR1_ALERTEN SMBus alert enable Device mode (SMBHEN=0): Host mode (SMBHEN=1): Note: When ALERTEN=0, the SMBA pin can be used as a standard GPIO. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_CR1_ALERTEN		(1 << 22)
/** I2C3_CR1_SMBDEN SMBus Device Default address enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_CR1_SMBDEN		(1 << 21)
/** I2C3_CR1_SMBHEN SMBus Host address enable Note: If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_CR1_SMBHEN		(1 << 20)
/** I2C3_CR1_GCEN General call enable **/
#define I2C3_CR1_GCEN		(1 << 19)
/** I2C3_CR1_WUPEN Wakeup from Stop mode enable Note: If the Wakeup from Stop mode feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. Note: WUPEN can be set only when DNF = 0000 **/
#define I2C3_CR1_WUPEN		(1 << 18)
/** I2C3_CR1_NOSTRETCH Clock stretching disable This bit is used to disable clock stretching in slave mode. It must be kept cleared in master mode. Note: This bit can only be programmed when the I2C is disabled (PE = 0). **/
#define I2C3_CR1_NOSTRETCH		(1 << 17)
/** I2C3_CR1_SBC Slave byte control This bit is used to enable hardware byte control in slave mode. **/
#define I2C3_CR1_SBC		(1 << 16)
/** I2C3_CR1_RXDMAEN DMA reception requests enable **/
#define I2C3_CR1_RXDMAEN		(1 << 15)
/** I2C3_CR1_TXDMAEN DMA transmission requests enable **/
#define I2C3_CR1_TXDMAEN		(1 << 14)
/** I2C3_CR1_ANFOFF Analog noise filter OFF Note: This bit can only be programmed when the I2C is disabled (PE = 0). **/
#define I2C3_CR1_ANFOFF		(1 << 12)

#define I2C3_CR1_DNF_SHIFT		8
#define I2C3_CR1_DNF_MASK		0x0f
/** @defgroup i2c3_cr1_dnf DNF Digital noise filter These bits are used to configure the digital noise filter on SDA and SCL input. The digital filter will filter spikes with a length of up to DNF[3:0] * tI2CCLK ... Note: If the analog filter is also enabled, the digital filter is added to the analog filter. This filter can only be programmed when the I2C is disabled (PE = 0).
@{*/
/**@}*/

/** I2C3_CR1_ERRIE Error interrupts enable Note: Any of these errors generate an interrupt: Arbitration Loss (ARLO) Bus Error detection (BERR) Overrun/Underrun (OVR) Timeout detection (TIMEOUT) PEC error detection (PECERR) Alert pin event detection (ALERT) **/
#define I2C3_CR1_ERRIE		(1 << 7)
/** I2C3_CR1_TCIE Transfer Complete interrupt enable Note: Any of these events will generate an interrupt: Transfer Complete (TC) Transfer Complete Reload (TCR) **/
#define I2C3_CR1_TCIE		(1 << 6)
/** I2C3_CR1_STOPIE STOP detection Interrupt enable **/
#define I2C3_CR1_STOPIE		(1 << 5)
/** I2C3_CR1_NACKIE Not acknowledge received Interrupt enable **/
#define I2C3_CR1_NACKIE		(1 << 4)
/** I2C3_CR1_ADDRIE Address match Interrupt enable (slave only) **/
#define I2C3_CR1_ADDRIE		(1 << 3)
/** I2C3_CR1_RXIE RX Interrupt enable **/
#define I2C3_CR1_RXIE		(1 << 2)
/** I2C3_CR1_TXIE TX Interrupt enable **/
#define I2C3_CR1_TXIE		(1 << 1)
/** I2C3_CR1_PE Peripheral enable Note: When PE=0, the I2C SCL and SDA lines are released. Internal state machines and status bits are put back to their reset value. When cleared, PE must be kept low for at least 3 APB clock cycles. **/
#define I2C3_CR1_PE		(1 << 0)

/**@}*/

/** @defgroup i2c3_cr2 CR2 Access: No wait states, except if a write access occurs while a write access to this register is ongoing. In this case, wait states are inserted in the second write access until the previous one is completed. The latency of the second write access can be up to 2 x PCLK1 + 6 x I2CCLK.
@{*/

/** I2C3_CR2_PECBYTE Packet error checking byte This bit is set by software, and cleared by hardware when the PEC is transferred, or when a STOP condition or an Address matched is received, also when PE=0. Note: Writing 0 to this bit has no effect. This bit has no effect when RELOAD is set. This bit has no effect is slave mode when SBC=0. If the SMBus feature is not supported, this bit is reserved and forced by hardware to 0. Please refer to Section25.3: I2C implementation. **/
#define I2C3_CR2_PECBYTE		(1 << 26)
/** I2C3_CR2_AUTOEND Automatic end mode (master mode) This bit is set and cleared by software. Note: This bit has no effect in slave mode or when the RELOAD bit is set. **/
#define I2C3_CR2_AUTOEND		(1 << 25)
/** I2C3_CR2_RELOAD NBYTES reload mode This bit is set and cleared by software. **/
#define I2C3_CR2_RELOAD		(1 << 24)

#define I2C3_CR2_NBYTES_SHIFT		16
#define I2C3_CR2_NBYTES_MASK		0xff
/** @defgroup i2c3_cr2_nbytes NBYTES Number of bytes The number of bytes to be transmitted/received is programmed there. This field is dont care in slave mode with SBC=0. Note: Changing these bits when the START bit is set is not allowed.
@{*/
/**@}*/

/** I2C3_CR2_NACK NACK generation (slave mode) The bit is set by software, cleared by hardware when the NACK is sent, or when a STOP condition or an Address matched is received, or when PE=0. Note: Writing 0 to this bit has no effect. This bit is used in slave mode only: in master receiver mode, NACK is automatically generated after last byte preceding STOP or RESTART condition, whatever the NACK bit value. When an overrun occurs in slave receiver NOSTRETCH mode, a NACK is automatically generated whatever the NACK bit value. When hardware PEC checking is enabled (PECBYTE=1), the PEC acknowledge value does not depend on the NACK value. **/
#define I2C3_CR2_NACK		(1 << 15)
/** I2C3_CR2_STOP Stop generation (master mode) The bit is set by software, cleared by hardware when a Stop condition is detected, or when PE = 0. In Master Mode: Note: Writing 0 to this bit has no effect. **/
#define I2C3_CR2_STOP		(1 << 14)
/** I2C3_CR2_START Start generation This bit is set by software, and cleared by hardware after the Start followed by the address sequence is sent, by an arbitration loss, by a timeout error detection, or when PE = 0. It can also be cleared by software by writing 1 to the ADDRCF bit in the I2C_ICR register. If the I2C is already in master mode with AUTOEND = 0, setting this bit generates a Repeated Start condition when RELOAD=0, after the end of the NBYTES transfer. Otherwise setting this bit will generate a START condition once the bus is free. Note: Writing 0 to this bit has no effect. The START bit can be set even if the bus is BUSY or I2C is in slave mode. This bit has no effect when RELOAD is set. **/
#define I2C3_CR2_START		(1 << 13)
/** I2C3_CR2_HEAD10R 10-bit address header only read direction (master receiver mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C3_CR2_HEAD10R		(1 << 12)
/** I2C3_CR2_ADD10 10-bit addressing mode (master mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C3_CR2_ADD10		(1 << 11)
/** I2C3_CR2_RD_WRN Transfer direction (master mode) Note: Changing this bit when the START bit is set is not allowed. **/
#define I2C3_CR2_RD_WRN		(1 << 10)
/** I2C3_CR2_SADD9 Slave address bit 9:8 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits are dont care In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 9:8 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD9		(1 << 9)
/** I2C3_CR2_SADD8 Slave address bit 9:8 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits are dont care In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 9:8 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD8		(1 << 8)
/** I2C3_CR2_SADD7 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD7		(1 << 7)
/** I2C3_CR2_SADD6 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD6		(1 << 6)
/** I2C3_CR2_SADD5 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD5		(1 << 5)
/** I2C3_CR2_SADD4 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD4		(1 << 4)
/** I2C3_CR2_SADD3 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD3		(1 << 3)
/** I2C3_CR2_SADD2 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD2		(1 << 2)
/** I2C3_CR2_SADD1 Slave address bit 7:1 (master mode) In 7-bit addressing mode (ADD10 = 0): These bits should be written with the 7-bit slave address to be sent In 10-bit addressing mode (ADD10 = 1): These bits should be written with bits 7:1 of the slave address to be sent. Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD1		(1 << 1)
/** I2C3_CR2_SADD0 Slave address bit 0 (master mode) In 7-bit addressing mode (ADD10 = 0): This bit is dont care In 10-bit addressing mode (ADD10 = 1): This bit should be written with bit 0 of the slave address to be sent Note: Changing these bits when the START bit is set is not allowed. **/
#define I2C3_CR2_SADD0		(1 << 0)

/**@}*/

